УчетВУправляющихДляГит1/src/ChartsOfCalculationTypes/Удержания/Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Удержания</name>
  <attributes>
    <name>КатегорияУдержания</name>
    <type>
      <types>EnumRef.КатегорииУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтражениеВУСН</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЯвляетсяДСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииПоЗарплате</name>
    <type>
      <types>EnumRef.ВидыОперацийПоЗарплате</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCalculationTypes>

УчетВУправляющихДляГит1/src/Enums/КатегорииУдержаний/КатегорииУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииУдержаний</name>
  <enumValues>
    <name>ПрофсоюзныеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛист</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеПлатежногоАгента</name>
  </enumValues>
  <enumValues>
    <name>ДСВ</name>
  </enumValues>
  <enumValues>
    <name>ДобровольныеВзносыВНПФ</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыОперацийПоЗарплате/ВидыОперацийПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоЗарплате</name>
  <enumValues>
    <name>АлиментыПрочиеИсполнительныеЛисты</name>
  </enumValues>
  <enumValues>
    <name>АлиментыПрочиеИсполнительныеЛистыКонтрагенты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок</name>
  </enumValues>
  <enumValues>
    <name>ВозмещениеУщерба</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеПлатежногоАгента</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеПлатежногоАгентаКонтрагенты</name>
  </enumValues>
  <enumValues>
    <name>ВыплатыБывшимСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>Депонирование</name>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ДобровольныеВзносыВНПФ</name>
  </enumValues>
  <enumValues>
    <name>ДоговорАвторскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ДоговорРаботыУслуги</name>
  </enumValues>
  <enumValues>
    <name>ДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ДСВ</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускОценочныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускОценочныеОбязательстваИРезервы</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускРезервы</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЕжегодногоОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЕжегодногоОтпускаОценочныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаЗадержкуЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>НатуральныйДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоПроцентовПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>НачисленоСдельноДоход</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛРасчетыСБывшимиСотрудниками</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ОценкаОбязательстваИФормированиеРезервов</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймов</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребение</name>
  </enumValues>
  <enumValues>
    <name>Профвзносы</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеУдержания</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюБюджет</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюРаботодатель</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюФСС</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованиюФССНС</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДепонента</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеЗаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеНеизрасходованныхПодотчетныхСумм</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеПоПрочимОперациямСРаботниками</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ЕжегодныйОтпускАвансом</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/ChartsOfCalculationTypes/Удержания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////
// Блок функций первоначального заполнения и обновления ИБ

// Создает и заполняет соответствие, ключом которого является категория удержания, 
// а значением - структура значений, определяющая заполнение свойств удержания данной категории.
//
// Параметры
//	- КатегорияУдержания - ПеречислениеСсылка.КатегорииУдержаний.
//
// Возвращаемое значение - соответствие
//
Функция СвойстваУдержанийПоКатегориям() Экспорт
	
	СвойстваПоКатегориям = Новый Соответствие;
	
	// Значение по умолчанию
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ПустаяСсылка(), СвойстваУдержанияПоКатегорииПоУмолчанию());
	
	// Профсоюзные взносы
	Описание = СвойстваУдержанияПоКатегорииПоУмолчанию();
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.Профвзносы;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ПрофсоюзныеВзносы, Описание);
	
	// Исполнительный лист
	Описание = СвойстваУдержанияПоКатегорииПоУмолчанию();
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ИсполнительныйЛист, Описание);
	
	// Вознаграждение платежного агента
	Описание = СвойстваУдержанияПоКатегорииПоУмолчанию();
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ВознаграждениеПлатежногоАгента, Описание);
	
	// ДСВ
	Описание = СвойстваУдержанияПоКатегорииПоУмолчанию();
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ДСВ;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ДСВ, Описание);
	
	// ДобровольныеВзносыВНПФ
	Описание = СвойстваУдержанияПоКатегорииПоУмолчанию();
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.ДобровольныеВзносыВНПФ;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ДобровольныеВзносыВНПФ, Описание);
	
	Возврат СвойстваПоКатегориям;
		
КонецФункции

Процедура СоздатьУдержанияПоНастройкам() Экспорт
	
	СвойстваУдержаний = СвойстваУдержанийПоКатегориям();
	
	// Исполнительный лист
	Описание = ОписаниеУдержания();
	Описание.КатегорияУдержания			= Перечисления.КатегорииУдержаний.ИсполнительныйЛист;
	ЗаполнитьЗначенияСвойств(Описание, СвойстваУдержаний[Перечисления.КатегорииУдержаний.ИсполнительныйЛист]);
	Описание.Код						= НСтр("ru = 'ИСПДК'");
	Описание.Наименование				= НСтр("ru = 'Исполнительный лист'");
	СоздатьИзменитьУдержанияПоОписанию(Описание);
	
	// Профсоюзные взносы
	Описание = ОписаниеУдержания();
	Описание.КатегорияУдержания		= Перечисления.КатегорииУдержаний.ПрофсоюзныеВзносы;
	ЗаполнитьЗначенияСвойств(Описание, СвойстваУдержаний[Перечисления.КатегорииУдержаний.ПрофсоюзныеВзносы]);
	Описание.Код					= НСтр("ru = 'ПРФВЗ'");
	Описание.Наименование			= НСтр("ru = 'Профсоюзные взносы'");
	СоздатьИзменитьУдержанияПоОписанию(Описание);
	
	// ДСВ
	Описание = ОписаниеУдержания();
	Описание.КатегорияУдержания			= Перечисления.КатегорииУдержаний.ДСВ;
	ЗаполнитьЗначенияСвойств(Описание, СвойстваУдержаний[Перечисления.КатегорииУдержаний.ДСВ]);
	Описание.Код						= НСтр("ru = 'ДСВЗН'");
	Описание.Наименование				= НСтр("ru = 'Добровольные страховые взносы'");
	СоздатьИзменитьУдержанияПоОписанию(Описание);
	
	// Добровольные взносы в НПФ
	Описание = ОписаниеУдержания();
	Описание.КатегорияУдержания			= Перечисления.КатегорииУдержаний.ДобровольныеВзносыВНПФ;
	ЗаполнитьЗначенияСвойств(Описание, СвойстваУдержаний[Перечисления.КатегорииУдержаний.ДобровольныеВзносыВНПФ]);
	Описание.Код						= НСтр("ru = 'ДВНПФ'");
	Описание.Наименование				= НСтр("ru = 'Добровольные взносы в НПФ'");
	СоздатьИзменитьУдержанияПоОписанию(Описание);
	
	// Вознаграждение платежному агенту.
	Описание = ОписаниеУдержания();
	Описание.КатегорияУдержания			= Перечисления.КатегорииУдержаний.ВознаграждениеПлатежногоАгента;
	ЗаполнитьЗначенияСвойств(Описание, СвойстваУдержаний[Перечисления.КатегорииУдержаний.ВознаграждениеПлатежногоАгента]);
	Описание.Код						= НСтр("ru = 'АГЕНТ'");
	Описание.Наименование				= НСтр("ru = 'Вознаграждение платежного агента'");
	СоздатьИзменитьУдержанияПоОписанию(Описание);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеУдержания()
	
	Описание = Новый Структура(
	"Код, 
	|Наименование,
	|КатегорияУдержания,
	|ВидОперацииПоЗарплате,
	|СсылкаНаОбъект");
	
	Возврат Описание;
	
КонецФункции

Функция СвойстваУдержанияПоКатегорииПоУмолчанию()
	
	Описание = Новый Структура("ВидОперацииПоЗарплате");
	
	Возврат Описание;
	
КонецФункции

Процедура СоздатьИзменитьУдержанияПоОписанию(Описание)
	
	УдержанияПоКатегории = РасчетЗарплаты.УдержанияПоКатегории(Описание.КатегорияУдержания);
	Если УдержанияПоКатегории.Количество() > 0 Тогда
		УдержаниеОбъект = УдержанияПоКатегории[0].ПолучитьОбъект();
	Иначе
		УдержаниеОбъект = Неопределено;
	КонецЕсли;
	
	Если УдержаниеОбъект = Неопределено Тогда
		// Устанавливаем ссылку новому объекту
		УдержаниеСсылка = ПланыВидовРасчета.Удержания.ПолучитьСсылку();
		УдержаниеОбъект = ПланыВидовРасчета.Удержания.СоздатьВидРасчета();
		УдержаниеОбъект.УстановитьСсылкуНового(УдержаниеСсылка);
		Описание.СсылкаНаОбъект = УдержаниеСсылка;
	Иначе
		УдержаниеСсылка = УдержаниеОбъект.Ссылка;
		УдержаниеОбъект.ПометкаУдаления = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(УдержаниеОбъект, Описание);
	УдержаниеОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
